CREATE DATABASE  IF NOT EXISTS `wholesale` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `wholesale`;
-- MySQL dump 10.13  Distrib 8.0.36, for Linux (x86_64)
--
-- Host: localhost    Database: wholesale
-- ------------------------------------------------------
-- Server version	8.0.43

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `porder`
--

DROP TABLE IF EXISTS `porder`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `porder` (
  `id` int NOT NULL AUTO_INCREMENT,
  `porder_id` varchar(45) DEFAULT '',
  `customerid` varchar(45) DEFAULT '',
  `status` varchar(45) DEFAULT '處理中',
  `payment_method` varchar(45) DEFAULT '信用卡',
  `shipping_address` varchar(100) DEFAULT '',
  `created_at` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `total` int DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=111 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `porder`
--

LOCK TABLES `porder` WRITE;
/*!40000 ALTER TABLE `porder` DISABLE KEYS */;
INSERT INTO `porder` VALUES (1,'ORD001','CUST001','已出貨','信用卡','台北市中山區南京東路100號','2025-01-10 14:32:00',NULL),(2,'ORD002','CUST002','已完成','現金','新北市板橋區文化路55號','2025-01-12 09:15:00',NULL),(3,'ORD003','CUST003','處理中','Line Pay','桃園市中壢區中正路88號','2025-01-13 17:45:00',NULL),(4,'ORD004','CUST004','已完成','銀行轉帳','台中市西屯區台灣大道300號','2025-01-14 11:20:00',NULL),(5,'ORD005','CUST005','待出貨','貨到付款','高雄市苓雅區中正一路200號','2025-01-15 10:10:00',NULL),(6,'ORD006','CUST006','已取消','行動支付','新竹市東區光復路66號','2025-01-16 16:50:00',NULL),(7,'ORD007','CUST007','已出貨','電子錢包','台南市東區青年路120號','2025-01-17 13:05:00',NULL),(8,'ORD008','CUST008','處理中','街口支付','彰化縣彰化市中山路220號','2025-01-18 15:45:00',NULL),(9,'ORD009','CUST009','已完成','超商代碼繳費','基隆市仁愛區愛三路45號','2025-01-19 08:30:00',NULL),(10,'ORD010','CUST010','待出貨','PayPal','花蓮市中正路168號','2025-01-20 18:25:00',NULL),(11,'ORD011','CUST013','已付款','信用卡','桃園市中壢區中大路88號','2025-01-20 18:30:58',NULL),(12,'ORD012','CUST013','處理中','轉帳','桃園市中壢區中大路88號','2025-02-02 08:09:10',NULL),(13,'ORD013','CUST022','已出貨','信用卡','高雄市左營區自由三路89號','2025-10-11 01:02:03',NULL),(14,'ORD014','CUST021','已付款','現金','台北市中山區松江路101號','2025-10-12 02:03:04',NULL),(15,'ORD015','CUST024','已出貨','信用卡','台中市南屯區永春東路20號','2025-10-18 15:42:11',123),(16,'ORD016','CUST026','待付款','轉帳','花蓮市中正路66號','2025-10-14 20:59:59',NULL),(17,'ORD017','CUST027','已付款','信用卡','高雄市左營區自由三路89號','2025-10-03 22:11:44',NULL),(18,'ORD018','CUST003','已出貨','現金','桃園市中壢區中大路88號','2025-09-09 07:07:07',NULL),(19,'ORD019','CUST005','已出貨','轉帳','新竹市光復路二段102號','2025-08-17 03:04:05',NULL),(20,'ORD020','CUST002','已付款','信用卡','高雄市左營區自由三路89號','2025-10-18 05:06:07',NULL),(21,'ORD021','CUST028','待出貨','現金','美國洛杉磯','2025-10-20 19:50:48',NULL),(22,'ORD022','CUST029','處理中','信用卡','美國紐約市','2025-10-20 21:19:42',1000),(23,'','customerid','處理中','信用卡','shipping_address','2025-10-21 00:15:17',100),(24,'','CUST030','處理中','信用卡','Test Addr','2025-10-21 00:16:08',100),(25,'','CUST037','處理中','信用卡','ok','2025-10-21 00:34:38',2495),(26,'','CUST037','處理中','信用卡','jj','2025-10-21 00:35:39',4491),(27,'','CUST038','處理中','信用卡','addrTest','2025-10-21 00:49:32',200),(28,'','CUST039','處理中','信用卡','addrTest','2025-10-21 00:50:12',200),(29,'','CUST037','處理中','信用卡','xcx','2025-10-21 00:59:10',1996),(30,'','CUST037','處理中','信用卡','30 test','2025-10-21 01:17:18',14970),(31,'ORD031','CUST037','處理中','信用卡','4 test','2025-10-21 01:19:06',1996),(32,'ORD032','CUST037','處理中','信用卡','yo','2025-10-21 01:47:30',2994),(33,'ORD033','CUST037','處理中','信用卡','man','2025-10-21 01:48:54',3493),(34,'ORD034','CUST037','處理中','信用卡','gr','2025-10-21 01:54:43',2495),(35,'ORD035','CUST037','處理中','信用卡','sss','2025-10-21 08:00:43',1497),(36,'ORD036','CUST037','處理中','信用卡','order item id test','2025-10-21 08:14:14',1497),(37,'ORD037','CUST037','處理中','信用卡','order item id test','2025-10-21 08:14:44',1497),(38,'ORD038','CUST037','處理中','信用卡','test order item id return','2025-10-21 08:20:05',998),(39,'ORD039','CUST037','處理中','信用卡','test','2025-10-21 08:22:53',4990),(40,'ORD040','CUST037','處理中','信用卡','ppp','2025-10-21 09:14:29',499),(41,'ORD041','CUST037','處理中','信用卡','la','2025-10-21 09:33:29',499),(42,'ORD042','CUST037','處理中','信用卡','kk','2025-10-21 09:34:11',1497),(43,'ORD043','CUST037','處理中','信用卡','oioioio','2025-10-21 09:39:45',2495),(44,'ORD044','CUST037','處理中','信用卡','laboy','2025-10-21 09:40:51',4491),(45,'ORD045','CUST037','處理中','信用卡','oba','2025-10-21 09:52:57',4989501),(46,'ORD046','CUST037','處理中','信用卡','test chas change_1','2025-10-21 10:05:17',499000),(47,'ORD047','CUST037','處理中','信用卡','test chas again','2025-10-21 10:09:10',998),(48,'ORD048','CUST037','處理中','信用卡','','2025-10-21 13:13:43',3992),(49,'ORD049','CUST037','處理中','信用卡','test view','2025-10-21 13:23:18',5988),(50,'ORD050','CUST037','處理中','信用卡','kol','2025-10-21 14:24:33',998),(51,'ORD051','CUST037','處理中','信用卡','limit!!','2025-10-21 14:27:40',199600),(52,'ORD052','CUST001','處理中','信用卡','official test 1','2025-10-21 14:42:46',2495),(53,'ORD053','CUST001','處理中','信用卡','test 14:58','2025-10-21 14:58:35',499),(54,'ORD054','CUST001','處理中','信用卡','add speaker','2025-10-21 18:48:02',3578),(55,'ORD055','CUST001','處理中','信用卡','string concat','2025-10-21 18:52:17',1789),(56,'ORD056',NULL,'處理中','信用卡',NULL,'2025-10-21 19:16:13',0),(57,'ORD057','CUST001','處理中','信用卡','adds 3 items','2025-10-21 19:19:23',1677),(58,'ORD058','CUST001','處理中','信用卡','add 3 again','2025-10-21 19:20:10',1308),(59,'ORD059','CUST001','處理中','信用卡','test addr','2025-10-22 00:33:40',10),(60,'ORD060','CUST001','處理中','信用卡','test addr','2025-10-22 00:38:31',10),(61,'ORD061','CUST001','處理中','信用卡','test order items','2025-10-22 00:56:53',390),(62,'ORD062','CUST001','處理中','信用卡','order item id test','2025-10-22 01:02:34',390),(63,'ORD063','CUST001','處理中','信用卡','Helloween','2025-10-22 21:18:14',1170),(64,'ORD064','CUST001','處理中','信用卡','turckey','2025-10-22 21:19:51',390),(65,'ORD065','CUST001','處理中','信用卡','test excel','2025-10-22 21:57:12',259),(66,'ORD066','CUST001','處理中','信用卡','','2025-10-22 22:04:10',390),(67,'ORD067','CUST001','處理中','信用卡','','2025-10-22 22:05:39',1580),(68,'ORD068','CUST001','處理中','信用卡','','2025-10-22 22:07:59',1418),(69,'ORD069','CUST001','處理中','信用卡','','2025-10-22 22:11:16',418),(70,'ORD070','CUST001','處理中','信用卡','','2025-10-22 22:11:49',1370),(71,'ORD071','CUST001','處理中','信用卡','','2025-10-22 22:21:14',0),(72,'ORD072','CUST001','處理中','信用卡','','2025-10-22 22:23:38',499),(73,'ORD073','CUST001','處理中','信用卡','','2025-10-22 22:28:25',499),(74,'ORD074','CUST001','處理中','信用卡','','2025-10-22 22:28:25',499),(75,'ORD075','CUST001','處理中','信用卡','','2025-10-22 22:29:55',499),(76,'ORD076','CUST001','處理中','信用卡','','2025-10-22 22:29:55',499),(77,'ORD077','CUST001','處理中','信用卡','','2025-10-22 22:34:59',1290),(78,'ORD078','CUST001','處理中','信用卡','','2025-10-22 22:34:59',1290),(79,'ORD079','CUST001','處理中','信用卡','','2025-10-22 22:35:22',889),(80,'ORD080','CUST001','處理中','信用卡','','2025-10-22 22:40:32',1789),(81,'ORD081','CUST001','處理中','信用卡','','2025-10-22 22:40:32',1789),(82,'ORD082','CUST001','處理中','信用卡','','2025-10-22 22:41:24',1789),(83,'ORD083','CUST001','處理中','信用卡','','2025-10-22 22:41:24',1789),(84,'ORD084','CUST001','處理中','信用卡','all selected','2025-10-22 23:07:25',6415),(85,'ORD085','CUST001','處理中','信用卡','all selected','2025-10-22 23:07:25',6415),(86,'ORD086','CUST001','處理中','信用卡','all selected','2025-10-22 23:07:25',6415),(87,'ORD087','CUST001','處理中','信用卡','all selected','2025-10-22 23:07:26',6415),(88,'ORD088','CUST001','處理中','信用卡','all selected','2025-10-22 23:07:26',6415),(89,'ORD089','CUST001','處理中','信用卡','all selected','2025-10-22 23:07:26',6415),(90,'ORD090','CUST001','處理中','信用卡','all selected','2025-10-22 23:07:26',6415),(91,'ORD091','CUST001','處理中','信用卡','all selected','2025-10-22 23:07:26',6415),(92,'ORD092','CUST001','處理中','信用卡','all selected','2025-10-22 23:07:26',6415),(93,'ORD093','CUST001','處理中','信用卡','all selected','2025-10-22 23:07:26',6415),(94,'ORD094','CUST001','處理中','信用卡','all selected','2025-10-22 23:07:26',6415),(95,'ORD095','CUST001','處理中','信用卡','fourth time ','2025-10-22 23:28:39',6352),(96,'ORD095','CUST001','處理中','信用卡','fourth time ','2025-10-22 23:28:39',6352),(97,'ORD095','CUST001','處理中','信用卡','fourth time ','2025-10-22 23:28:39',6352),(98,'ORD096','CUST001','處理中','信用卡','','2025-10-22 23:41:58',5358),(99,'ORD096','CUST001','處理中','信用卡','','2025-10-22 23:41:58',5358),(100,'ORD096','CUST001','處理中','信用卡','','2025-10-22 23:41:58',5358),(101,'ORD097','CUST001','處理中','信用卡','test jean id','2025-10-22 23:43:54',5358),(102,'ORD097','CUST001','處理中','信用卡','test jean id','2025-10-22 23:43:54',5358),(103,'ORD097','CUST001','處理中','信用卡','test jean id','2025-10-22 23:43:54',5358),(104,'ORD098','CUST001','處理中','信用卡','test porder id : must one record','2025-10-22 23:50:13',12130),(105,'ORD099','CUST001','處理中','信用卡','test porder_id only one','2025-10-22 23:51:47',6552),(106,'ORD100','CUST001','處理中','信用卡','testing mouse order item id','2025-10-22 23:56:08',10884),(107,'ORD101','CUST001','處理中','信用卡','test excel ','2025-10-23 00:37:57',4358),(108,'ORD102','CUST001','處理中','信用卡','test excel 2','2025-10-23 00:51:01',5785),(109,'ORD103','CUST001','處理中','信用卡','excel test 3','2025-10-23 00:52:04',1588),(110,'ORD104','CUST001','處理中','信用卡','','2025-10-23 13:59:43',2239);
/*!40000 ALTER TABLE `porder` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-10-23 15:30:56
